app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Pokemon"], ["created_at", "2015-11-09 07:04:44.343540"], ["updated_at", "2015-11-09 07:04:44.343540"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save