app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas" WHERE "ideas"."user_id" = $1  [["user_id", 179]]
---
  def index
    @user = current_user
    @ideas = @user.ideas.all

INSERT INTO "ideas" ("title", "body", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Pokeball"], ["body", "charizard"], ["user_id", 121]]
---
  def create
    @user   = current_user
      @idea = @user.ideas.new(ideas_params)
    if @idea.save

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 236]]
---
  def edit
    @idea = Idea.find(params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 15]]
UPDATE "ideas" SET "title" = $1, "body" = $2 WHERE "ideas"."id" = $3  [["title", "Gary"], ["body", "sucks"], ["id", 15]]
---
  def update
    @idea = Idea.find(params[:id])
    if @idea.update(ideas_params)