app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "jhunbug"], ["password", "password"], ["created_at", "2015-11-06 23:55:54.412597"], ["updated_at", "2015-11-06 23:55:54.412597"]]